Ran Plan for 3 projects:

1. dir: `01_Common/01_Route53/01_Zone` workspace: `default`
1. dir: `01_Common/01_Route53/02_Record` workspace: `default`
1. dir: `.` workspace: `default`

### 1. dir: `01_Common/01_Route53/01_Zone` workspace: `default`
**Plan Error**
```
running "/usr/bin/terraform plan -input=false -refresh -out \"/home/ubuntu/.atlantis/repos/rhea-so-lab/Infrastructure-as-Code/91/default/01_Common/01_Route53/01_Zone/default.tfplan\"" in "/home/ubuntu/.atlantis/repos/rhea-so-lab/Infrastructure-as-Code/91/default/01_Common/01_Route53/01_Zone": exit status 1
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 1:
│    1: variable "name" {
│ 
│ The root module input variable "name" is not set, and has no default value.
│ Use a -var or -var-file command line argument to provide a value for this
│ variable.
╵

```

---
### 2. dir: `01_Common/01_Route53/02_Record` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform plan -input=false -refresh -out \"/home/ubuntu/.atlantis/repos/rhea-so-lab/Infrastructure-as-Code/91/default/01_Common/01_Route53/02_Record/default.tfplan\"" in "/home/ubuntu/.atlantis/repos/rhea-so-lab/Infrastructure-as-Code/91/default/01_Common/01_Route53/02_Record": exit status 1
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 1:
│    1: variable "zone_id" {
│ 
│ The root module input variable "zone_id" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 5:
│    5: variable "name" {
│ 
│ The root module input variable "name" is not set, and has no default value.
│ Use a -var or -var-file command line argument to provide a value for this
│ variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 19:
│   19: variable "target" {
│ 
│ The root module input variable "target" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵

```
</details>

---
### 3. dir: `.` workspace: `default`
<details><summary>Show Output</summary>

```diff
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.atlantis-rhea-so.aws_route53_record.domain will be created
+ resource "aws_route53_record" "domain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "atlantis.rhea-so.com"
      + records         = [
          + "52.78.144.248",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.rhea-so.aws_route53_zone.domain will be created
+ resource "aws_route53_zone" "domain" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = true
      + id            = (known after apply)
      + name          = "rhea-so.com"
      + name_servers  = (known after apply)
      + tags_all      = (known after apply)
      + zone_id       = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---

